tests/fixtures/export/m-class.mmd
---
title: "Animals"
---
classDiagram
  class Animal {
    +age: int
    +isMammal(): bool
  }
  class Duck {
    +beakColor: String
    +swim()
  }
  class Fish {
    <<interface>>
    +swim()
  }
  class Egg
  Animal <|-- Duck
  Animal <|-- Fish
  Duck "1" *-- "many" Egg : lays
