tests/fixtures/export/m-class.puml
@startuml
title Animals
class "Animal" as C0 {
  +age: int
  +isMammal(): bool
}
class "Duck" as C1 {
  +beakColor: String
  +swim()
}
interface "Fish" as C2 {
  +swim()
}
class "Egg" as C3
C0 <|-- C1
C0 <|-- C2
C3 "many" -- "1" C1 : lays
@enduml
